import 'js/web.jsx';

import 'Ctrl.jsx';

// ----------------------------------------------------------------
// ----------------------------------------------------------------
// ----------------------------------------------------------------

// メッセージ表示クラス
class Message{
	static var div : HTMLDivElement;

	// ----------------------------------------------------------------
	// 初期化
	static function init() : void{
		// div作成
		Message.div = dom.document.createElement("div") as HTMLDivElement;
		Message.div.className = "message";
		// DOM登録
		Ctrl.div.appendChild(Message.div);

		// test
		Message.div.innerHTML = "あと0マス";
	}
}

// ----------------------------------------------------------------
// ----------------------------------------------------------------
// ----------------------------------------------------------------

